In [1]:
import pymysql
import pandas as pd

with open('./db_config.txt') as f:
    res = dict(map(lambda x: x.replace('\n','').split('='), f.readlines()))
    for i, v in res.items():
        if v.isdigit(): res[i] = int(v)
con = pymysql.connect(**res)
cur = con.cursor()
# cur.execute('create table student(id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16))')
table = 'student'
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
cur.execute(f'create table {table}({cols})')

cur.execute('insert into student values(1, "김아무개", "mymail@github.com", "010-1234-1234", "사회과학")')
cur.execute('select * from student')
print('first\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('update student set email="yourmail@github.com" where id=1')
cur.execute('select * from student')
print('second\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('delete from student where id=1')
cur.execute('select * from student')
print('third\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('desc student')
print('third\n', pd.DataFrame(cur.fetchall()), '\n')
cur.execute('drop table student')
con.close()

first
    0     1                  2              3     4
0  1  김아무개  mymail@github.com  010-1234-1234  사회과학

second
    0     1                    2              3     4
0  1  김아무개  yourmail@github.com  010-1234-1234  사회과학

third
 Empty DataFrame
Columns: []
Index: []

third
        0            1    2 3     4 5
0     id      int(11)   NO    None
1   name  varchar(16)  YES    None
2  email  varchar(32)  YES    None
3  phone  varchar(16)  YES    None
4  major  varchar(16)  YES    None

In [2]:
from StartSQL import StartSQL

with open('./db_config.txt') as f:
    res = dict(map(lambda x: x.replace('\n','').split('='), f.readlines()))
    for i, v in res.items():
        if v.isdigit(): res[i] = int(v)
tmp = StartSQL(res['user'], res['password'], res['database'])
cols = 'id int not null, name varchar(16), email varchar(32), phone varchar(16), major varchar(16)'
tmp.create_table('student', cols)
tmp.select_table('student')
tmp.insert(1,'김아무개','mymail@github.com','010-1234-1234','사회과학')
manyList = [[2, '이아무개', 'yourmail@github.com', '010-1234-5678','자연과학'],
            [3, '박아무개', 'theirmail@github.com', '010-5678-5678','인문학']]
tmp.insert_many(manyList)

True

In [3]:
tmp.select()

   0     1                     2              3     4
0  1  김아무개     mymail@github.com  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학

In [4]:
tmp.select('*',1)

   0     1                  2              3     4
0  1  김아무개  mymail@github.com  010-1234-1234  사회과학

In [5]:
tmp.select('id',1)

   0
0  1

In [6]:
tmp.update('None','email',1)
tmp.select()

   0     1                     2              3     4
0  1  김아무개                  None  010-1234-1234  사회과학
1  2  이아무개   yourmail@github.com  010-1234-5678  자연과학
2  3  박아무개  theirmail@github.com  010-5678-5678   인문학

In [7]:
tmp.delete(2)
tmp.select()

   0     1                     2              3     4
0  1  김아무개                  None  010-1234-1234  사회과학
1  3  박아무개  theirmail@github.com  010-5678-5678   인문학

In [8]:
tmp.end()